In [8]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

Bayangkan kamu adalah admin kampus yang bertugas menyeleksi mahasiswa untuk mendapatkan beasiswa. Kamu menerima data mentah dari formulir pendaftaran online, tapi datanya (lagi-lagi) berantakan.

Misi Kamu:
Hapus Duplikat: Ada mahasiswa yang submit formulir 2 kali karena tidak sabaran.

Isi Nilai Kosong: Ada mahasiswa yang lupa mengisi Skor_Tes. Jangan dihapus, kasihan. Isi saja pakai rata-rata atau median.

Hapus Data Aneh (Outlier): Ada yang salah isi Uang_Saku_Bulanan jadi milyaran (mungkin typo nol-nya kebanyakan). Hapus data ini agar tidak merusak rata-rata.

Encoding: Ubah kolom Jurusan menjadi angka agar bisa diproses komputer.

In [82]:
import pandas as pd
import numpy as np

# Membuat Dataset Mahasiswa (Kotor)
data_beasiswa = {
    'NIM': ['101', '102', '103', '104', '101', '105'], # NIM 101 Double
    'Nama': ['Alya', 'Beni', 'Cindi', 'Dito', 'Alya', 'Erik'],
    'Jurusan': ['Informatika', 'Manajemen', 'Informatika', 'Sastra', 'Informatika', 'Manajemen'],
    'Skor_Tes': [85, 90, np.nan, 88, 85, 40], # Nilai Cindi Kosong (NaN)
    'Uang_Saku_Juta': [1.5, 2.0, 1.8, 500, 1.5, 2.5] # Dito uang sakunya 500 Juta (Outlier/Typo)
}

df_mhs = pd.DataFrame(data_beasiswa)

df_mhs

   NIM   Nama      Jurusan  Skor_Tes  Uang_Saku_Juta
0  101   Alya  Informatika      85.0             1.5
1  102   Beni    Manajemen      90.0             2.0
2  103  Cindi  Informatika       NaN             1.8
3  104   Dito       Sastra      88.0           500.0
4  101   Alya  Informatika      85.0             1.5
5  105   Erik    Manajemen      40.0             2.5

In [83]:
df_mhs = df_mhs.drop_duplicates()
df_mhs

   NIM   Nama      Jurusan  Skor_Tes  Uang_Saku_Juta
0  101   Alya  Informatika      85.0             1.5
1  102   Beni    Manajemen      90.0             2.0
2  103  Cindi  Informatika       NaN             1.8
3  104   Dito       Sastra      88.0           500.0
5  105   Erik    Manajemen      40.0             2.5

In [84]:
df_mhs.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 0 to 5
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   NIM             5 non-null      object
 1   Nama            5 non-null      object
 2   Jurusan         5 non-null      object
 3   Skor_Tes        4 non-null      float64
 4   Uang_Saku_Juta  5 non-null      float64
dtypes: float64(2), object(3)
memory usage: 240.0+ bytes

In [85]:
df_mhs['Skor_Tes'] = df_mhs['Skor_Tes'].fillna(df_mhs['Skor_Tes'].median())
df_mhs

/tmp/ipykernel_78235/3206785964.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_mhs['Skor_Tes'] = df_mhs['Skor_Tes'].fillna(df_mhs['Skor_Tes'].median())

   NIM   Nama      Jurusan  Skor_Tes  Uang_Saku_Juta
0  101   Alya  Informatika      85.0             1.5
1  102   Beni    Manajemen      90.0             2.0
2  103  Cindi  Informatika      86.5             1.8
3  104   Dito       Sastra      88.0           500.0
5  105   Erik    Manajemen      40.0             2.5

In [86]:
numerical = df_mhs.select_dtypes(['number']).columns
numerical

Index(['Skor_Tes', 'Uang_Saku_Juta'], dtype='object')

In [87]:
q1 = df_mhs[numerical].quantile(0.25)
q3 = df_mhs[numerical].quantile(0.75)
iqr = q3 - q1

In [88]:
numerical_cols = ['Skor_Tes', 'Uang_Saku_Juta']

In [89]:
nonoutlier = ((df_mhs[numerical] < (q1 - 1.5 * iqr)) | (df_mhs[numerical] > (q3 + 1.5 * iqr))).any(axis=1)

In [ ]:
df_mhs[numerical] = df_mhs[numerical].clip(lower=q1 - 1.5 * iqr, upper=q3 + 1.5 * iqr, axis=1)

/tmp/ipykernel_78235/2315726232.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_mhs[numerical] = df_mhs[numerical].clip(lower=q1 - 1.5 * iqr, upper=q3 + 1.5 * iqr, axis=1)

   Skor_Tes  Uang_Saku_Juta
0      85.0            1.50
1      90.0            2.00
2      86.5            1.80
3      88.0            3.55
5      80.5            2.50

In [ ]:
plt.figure(figsize=(10, 5))
plt.subplot(1, 2, 1)
sns.boxplot(data=df_mhs[numerical])

In [136]:
categories = df_mhs.select_dtypes(['object'])
categories = categories.columns

In [167]:
df_one_hot = pd.get_dummies(df_mhs, columns=categories_oneHot.columns)
df_one_hot = df_one_hot.drop(columns=['NIM', 'Nama'])
df_one_hot

,Skor_Tes,Uang_Saku_Juta,Jurusan_Informatika,Jurusan_Manajemen,Jurusan_Sastra
0,85.0,1.50,True,False,False
1,90.0,2.00,False,True,False
2,86.5,1.80,True,False,False
3,88.0,3.55,False,False,True
5,80.5,2.50,False,True,False

In [162]:
pd.concat([df_mhs[numerical], df_one_hot], axis=1)

,Skor_Tes,Uang_Saku_Juta,NIM,Nama,Skor_Tes,Uang_Saku_Juta,Jurusan_Informatika,Jurusan_Manajemen,Jurusan_Sastra
0,85.0,1.50,101,Alya,85.0,1.50,True,False,False
1,90.0,2.00,102,Beni,90.0,2.00,False,True,False
2,86.5,1.80,103,Cindi,86.5,1.80,True,False,False
3,88.0,3.55,104,Dito,88.0,3.55,False,False,True
5,80.5,2.50,105,Erik,80.5,2.50,False,True,False

In [163]:
df_one_hot

,NIM,Nama,Skor_Tes,Uang_Saku_Juta,Jurusan_Informatika,Jurusan_Manajemen,Jurusan_Sastra
0,101,Alya,85.0,1.50,True,False,False
1,102,Beni,90.0,2.00,False,True,False
2,103,Cindi,86.5,1.80,True,False,False
3,104,Dito,88.0,3.55,False,False,True
5,105,Erik,80.5,2.50,False,True,False

In [138]:
df_mhs[categories]

   NIM   Nama      Jurusan
0  101   Alya  Informatika
1  102   Beni    Manajemen
2  103  Cindi  Informatika
3  104   Dito       Sastra
5  105   Erik    Manajemen